In [18]:
import pandas as pd
import numpy as np

In [5]:
data = [1,2,3,4,5]
series = pd.Series(data)
print("series \n", series)

series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# Create a series from Dictionary
data = {"a":1,"b":2,"c":3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [10]:
data = [10,20,30]
index = [1,2,3]

indexed_series = pd.Series(data, index=index)
indexed_series, type(indexed_series)

(1    10
 2    20
 3    30
 dtype: int64,
 pandas.core.series.Series)

In [12]:
new = indexed_series.reset_index()
new, type(new)

(   index   0
 0      1  10
 1      2  20
 2      3  30,
 pandas.core.frame.DataFrame)

In [17]:
## Dataframe
# create dataframe from dictionary

data = {
    "Name": ["Sarthak", "Jojo", "Fofo"],
    "Age": [29, 92, 65],
    "City": ["Bangalore", "Delhi", "Charkhi Dadri"]
}
df = pd.DataFrame(data)
df

      Name  Age           City
0  Sarthak   29      Bangalore
1     Jojo   92          Delhi
2     Fofo   65  Charkhi Dadri

In [20]:
# if i want all the data point as array
arr = np.array(df)
arr

array([['Sarthak', 29, 'Bangalore'],
       ['Jojo', 92, 'Delhi'],
       ['Fofo', 65, 'Charkhi Dadri']], dtype=object)

In [29]:
## Create a df a list of dict

data = [
    {"name":"Sarthak", "place": "Delhi"},
    {"name": "Bappi", "place": "Gagan"}
]

df = pd.DataFrame(data)

In [22]:
# reading from csv file
df = pd.read_csv("/home/satyukt/Sarthak/100_days_of_code/bootcamp/python/data_analysis/Sales Data.csv")
df.head()

,Unnamed: 0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales,City,Hour
0,0,295665,Macbook Pro Laptop,1,1700.00,2019-12-30 00:01:00,"136 Church St, New York City, NY 10001",12,1700.00,New York City,0
1,1,295666,LG Washing Machine,1,600.00,2019-12-29 07:03:00,"562 2nd St, New York City, NY 10001",12,600.00,New York City,7
2,2,295667,USB-C Charging Cable,1,11.95,2019-12-12 18:21:00,"277 Main St, New York City, NY 10001",12,11.95,New York City,18
3,3,295668,27in FHD Monitor,1,149.99,2019-12-22 15:13:00,"410 6th St, San Francisco, CA 94016",12,149.99,San Francisco,15
4,4,295669,USB-C Charging Cable,1,11.95,2019-12-18 12:38:00,"43 Hill St, Atlanta, GA 30301",12,11.95,Atlanta,12

In [34]:
## Create a df a list of dict

data = {
    "Name": ["Sarthak", "Jojo", "Fofo"],
    "Age": [29, 92, 65],
    "City": ["Bangalore", "Delhi", "Charkhi Dadri"]
}
df = pd.DataFrame(data)
df

      Name  Age           City
0  Sarthak   29      Bangalore
1     Jojo   92          Delhi
2     Fofo   65  Charkhi Dadri

In [35]:
df

      Name  Age           City
0  Sarthak   29      Bangalore
1     Jojo   92          Delhi
2     Fofo   65  Charkhi Dadri

In [42]:
# at function
df.at[0, 'Name'], df.at[1, 'Name']

('Sarthak', 'Jojo')

In [41]:
# iat to pick up charki dadri

df.iat[2,2]

'Charkhi Dadri'

In [44]:
### data Manupilation with Dataframe
df

      Name  Age           City
0  Sarthak   29      Bangalore
1     Jojo   92          Delhi
2     Fofo   65  Charkhi Dadri

In [52]:
df["Salary"] = df["Age"] *1000
df

      Name  Age           City  Salary
0  Sarthak   29      Bangalore   29000
1     Jojo   92          Delhi   92000
2     Fofo   65  Charkhi Dadri   65000

In [53]:
df.drop('Salary', 1)

/tmp/ipykernel_576602/2395080803.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  df.drop('Salary', 1)

      Name  Age           City
0  Sarthak   29      Bangalore
1     Jojo   92          Delhi
2     Fofo   65  Charkhi Dadri

In [54]:
# still not deleted
df

      Name  Age           City  Salary
0  Sarthak   29      Bangalore   29000
1     Jojo   92          Delhi   92000
2     Fofo   65  Charkhi Dadri   65000

In [55]:
df.drop('Salary', 1, inplace=True)
df

/tmp/ipykernel_576602/2873013749.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  df.drop('Salary', 1, inplace=True)

      Name  Age           City
0  Sarthak   29      Bangalore
1     Jojo   92          Delhi
2     Fofo   65  Charkhi Dadri

In [57]:
#drop a row
df.drop(1, inplace=True)
df

      Name  Age           City
0  Sarthak   29      Bangalore
2     Fofo   65  Charkhi Dadri